{
  "url": "https://github.com/chenhui-bupt/PeopleDaily1998",
  "size": 230604,
  "time": 0.9708940982818604,
  "status": "成功",
  "images": [],
  "text": "GitHub - chenhui-bupt/PeopleDaily1998: 人民日报1998年1-4月中文标注语料库 Skip to content Navigation Menu Toggle navigation Sign in Product GitHub Copilot Write better code with AI Security Find and fix vulnerabilities Actions Automate any workflow Codespaces Instant dev environments Issues Plan and track work Code Review Manage code changes Discussions Collaborate outside of code Code Search Find more, search less Explore All features Documentation GitHub Skills Blog Solutions By company size Enterprises Small and medium teams Startups By use case DevSecOps DevOps CI/CD View all use cases By industry Healthcare Financial services Manufacturing Government View all industries View all solutions Resources Topics AI DevOps Security Software Development View all Explore Learning Pathways White papers, Ebooks, Webinars Customer Stories Partners Executive Insights Open Source GitHub Sponsors Fund open source developers The ReadME Project GitHub community articles Repositories Topics Trending Collections Enterprise Enterprise platform AI-powered developer platform Available add-ons Advanced Security Enterprise-grade security features GitHub Copilot Enterprise-grade AI features Premium Support Enterprise-grade 24/7 support Pricing Search or jump to... Search code, repositories, users, issues, pull requests... Search Clear Search syntax tips Provide feedback We read every piece of feedback, and take your input very seriously. Include my email address so I can be contacted Cancel Submit feedback Saved searches Use saved searches to filter your results more quickly Name Query To see all available qualifiers, see our documentation . Cancel Create saved search Sign in Sign up Reseting focus You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert chenhui-bupt / PeopleDaily1998 Public Notifications You must be signed in to change notification settings Fork 8 Star 29 人民日报1998年1-4月中文标注语料库 29 stars 8 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings Code Issues 1 Pull requests 0 Actions Projects 0 Security Insights Additional navigation options Code Issues Pull requests Actions Projects Security Insights chenhui-bupt/PeopleDaily1998 master Branches Tags Go to file Code Folders and files Name Name Last commit message Last commit date Latest commit History 2 Commits 199801.zip 199801.zip README.md README.md View all files Repository files navigation README PeopleDaily1998 人民日报标注语料库(版本1.0，下面简称PFR语料库)是在得到人民日报社新闻信息中心许可的条件下，以1998年人民日报语料为对象，由北京大学计算语言学研究所和富士通研究开发中心有限公司共同制作的标注语料库。该语料库对600多万字节的中文文章进行了分词及词性标注，其被作为原始数据应用于大量的研究和论文中。 About 人民日报1998年1-4月中文标注语料库 Resources Readme Activity Stars 29 stars Watchers 2 watching Forks 8 forks Report repository Releases No releases published Packages 0 No packages published Footer © 2024 GitHub, Inc. Footer navigation Terms Privacy Security Status Docs Contact Manage cookies Do not share my personal information You can’t perform that action at this time.",
  "image_count": 0
}