{
  "url": "https://www.bbc.com/",
  "size": 422684,
  "time": 0.5130734443664551,
  "status": "成功",
  "performance": {
    "dns_time": 0.0,
    "connect_time": 0,
    "response_time": 0.3594222068786621,
    "download_time": 0.0,
    "parse_time": 0.15365123748779297,
    "total_time": 0.5233767032623291,
    "image_count": 36,
    "text_length": 12777,
    "html_size": 422684,
    "status_code": 200
  },
  "domain": "www.bbc.com",
  "content_type": "text/html; charset=utf-8",
  "status_code": 200,
  "headers": {
    "Connection": "keep-alive",
    "Content-Length": "71229",
    "Content-Type": "text/html; charset=utf-8",
    "belfrage-cache-status": "MISS",
    "bid": "sally",
    "brequestid": "7aae497d6ff44c6c92cf447b328edc1d",
    "bsig": "1651d2367f46daf5fe7958c1ba501eac",
    "cache-control": "public, stale-if-error=90, stale-while-revalidate=30, max-age=30",
    "content-encoding": "gzip",
    "referrer-policy": "no-referrer-when-downgrade",
    "req-svc-chain": "FASTLY,GTM,BELFRAGE,BBCX",
    "via": "1.1 BBC-GTM, 1.1 Belfrage, 1.1 varnish",
    "x-content-type-options": "nosniff",
    "x-correlation-id": "b8ac1002-0aa0-4eea-9f32-d173bbec057e",
    "x-envoy-upstream-service-time": "2399",
    "x-frame-options": "SAMEORIGIN",
    "Origin-Agent-Cluster": "?0",
    "nel": "{\"report_to\":\"default\",\"max_age\":2592000,\"include_subdomains\":true,\"failure_fraction\":0.25}",
    "X-BBC-Edge-Cache-Status": "STALE",
    "report-to": "{\"group\":\"default\",\"max_age\":2592000,\"endpoints\":[{\"url\":\"https://default.bbc-reporting-api.app/report-endpoint\",\"priority\":1}],\"include_subdomains\":true}",
    "Server": "BBC-GTM",
    "Strict-Transport-Security": "max-age=31536000; preload",
    "Fastly-Restarts": "1",
    "Accept-Ranges": "bytes",
    "Date": "Tue, 24 Dec 2024 08:06:22 GMT",
    "X-Fastly-Cache-Status": "HIT-CLUSTER",
    "X-Served-By": "cache-sin-wsss1830075-SIN",
    "X-Cache": "HIT",
    "X-Cache-Hits": "1",
    "X-Timer": "S1735027583.776483,VS0,VE7",
    "X-Fastly-Pre-Flight-Cache": "MISS, HIT",
    "X-Fastly-Pre-Flight-Cache-Status": "HIT-CLUSTER",
    "X-cache-age": "27",
    "X-LB-NoCache": "true",
    "Vary": "X-BBC-Edge-Scheme,Accept-Encoding",
    "alt-svc": "h3=\":443\";ma=86400,h3-29=\":443\";ma=86400,h3-27=\":443\";ma=86400"
  },
  "images": [
    "https://www.bbc.com/bbcx/grey-placeholder.png",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/1d0b/live/ff0eb4b0-c16b-11ef-95f6-e57573aa8b55.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/2a9a/live/dc3fe690-c1c8-11ef-a0f2-fd81ae5962f4.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/e848/live/6f982980-c18c-11ef-b72d-71d4fd58cf13.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0dnyf44.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0k5w199.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/75e3/live/4840f3b0-c152-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/70f7/live/796e07a0-c13b-11ef-aff0-072ce821b6ab.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/0989/live/54640b70-c128-11ef-aff0-072ce821b6ab.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/ee75/live/8df94610-c0a7-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/aacc/live/e45d9180-bfc3-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/e27b/live/b3541010-bdf6-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/46c2/live/a68407a0-bfae-11ef-aff0-072ce821b6ab.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/abd0/live/ed6152f0-bfbc-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kcs9q7.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0jxywq0.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0h74xnl.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0k21mvc.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0jp296j.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/640x360/p0gstygv.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0k21mq7.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0h74xp9.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0h74xqs.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/1fa1/live/f2a00e10-c11e-11ef-b76e-9de78285d5f5.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/acbc/live/42976bd0-bfcf-11ef-a0f2-fd81ae5962f4.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/4eea/live/ce1eee00-a58d-11ef-ba92-adf0a1639f02.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/eff7/live/ead849e0-c137-11ef-a8c2-37ad53d91ed7.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p091py24.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/985f/live/ec6977f0-c189-11ef-b4d4-2d9bcb19a929.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/d403/live/91aab6a0-c1aa-11ef-80e9-9bdd4c6ab679.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/924d/live/3d97e170-bfbe-11ef-b603-e7778b27f3fc.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/4a90/live/114135e0-b960-11ef-a937-bb0098f9a5d0.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/8936/live/fdc8f110-c125-11ef-9f09-23b1103db065.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0k5m02k.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kcxgyr.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kdht0h.jpg.webp"
  ],
  "text": "BBC Home - Breaking News, World News, US News, Sports, Business, Innovation, Climate, Culture, Travel, Video & Audio Skip to content British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Video Live Audio Weather Newsletters As Biden commutes death row sentences, how Trump plans to expand executions Biden commuted the sentences of 37 of 40 death row inmates, derailing Trump's plan to ramp up executions. 7 hrs ago US & Canada The famous Christmas carol inspiring Ukraine's defenders Carol of the Bells was written in Pokrovsk, a key target for advancing Russian troops in Ukraine. 2 hrs ago Europe As Biden commutes death row sentences, how Trump plans to expand executions Biden commuted the sentences of 37 of 40 death row inmates, derailing Trump's plan to ramp up executions. 7 hrs ago US & Canada The famous Christmas carol inspiring Ukraine's defenders Carol of the Bells was written in Pokrovsk, a key target for advancing Russian troops in Ukraine. 2 hrs ago Europe Spacecraft attempts closest-ever approach to Sun The hope is the probe could help us to better understand how the Sun works. 8 hrs ago US & Canada Brazil shuts BYD factory site over 'slavery' conditions More than 160 workers have been rescued, according to local prosecutors. 50 mins ago World On patrol with Kenyan forces inside Haiti's gang warzone The BBC goes on patrol with the Kenyan officers sent to quell violence in gang-ravaged Haitian capital Port-au-Prince. 8 hrs ago Latin America Magdeburg attack offers far right fertile ground despite suspect's backing for AfD There is deep sadness in the city - and also anger directed at the government and migrants. 3 hrs ago Europe Scientists unveil 50,000-year-old baby mammoth remains \"Yana\" is the latest pre-historic discovery in a crater in a remote region of Russia. 14 hrs ago Europe Festive favourites The overlooked benefits of real Christmas trees The environmental pros and cons of Christmas trees go far beyond the climate impact of \"real or plastic\", scientists say. So what's the best choice for a green Christmas? 1 Dec 2024 Future How a modest 1990s hit came to define Christmas When it was first released in 1994, it made a mere ripple – but 30 years on, it is a track that reigns supreme over the holiday season. What is the secret of its success? 21 Nov 2024 Culture More news Indian fans fed up with paying top prices for stinking toilets and traffic jams at concerts 10 hrs ago Asia Australian towns evacuated over Christmas as fires rage 5 hrs ago Australia Chinese man in school attack gets suspended death sentence 3 hrs ago Asia Honda and Nissan join forces to take on China in cars 17 hrs ago Justin Baldoni women's solidarity award rescinded amid allegations 4 hrs ago US & Canada Must watch Watch: Cargo ship tips on its side in Turkey A cargo ship rolls over as it is being loaded at a port in Istanbul in the early hours of Monday morning. 15 hrs ago World Children tell Santa what they want for Christmas in 1967 Some familiar toys top the wish lists of these children as they visit a Scottish department store Santa. 17 hrs ago Scotland How can you have an eco-friendly Christmas? In the UK more than 100 million bags of rubbish get sent to landfill each Christmas. 20 hrs ago Wales Police officer dressed as the Grinch leads drug raid An officer in Peru smashed a suspected drug dealer's door in, while clad as Dr Seuss' famous character. 1 day ago Latin America Germany grapples with another Christmas market attack The BBC's Bethany Bell reports from the empty Magdeburg market, on what should be one of the busiest nights of the season. 3 days ago Europe Droppings or smooth sausages, what's a healthy poo? BBC health correspondent Jenny Rees outlines what is and is not normal when it comes to your poo. 2 days ago Wales Watch: Twins' dream of cleaning plane comes true James and John Makanjuola say they are \"buzzing\" after cleaning a British Airways plane. 2 days ago England Travis' Fran Healy sings karaoke to his own song Healy performed Why Does It Always Rain On Me? in Glasgow's Horseshoe bar on the eve of the band's gig at the Hydro. 3 days ago Year in review from our Culture editors The reason TV was so poor in 2024 This year was defined by a host of average TV shows that were glossy and watchable but forgettable – as epitomised by the Nicole Kidman thriller The Perfect Couple. Here's why. See more How LGBTQ stories got real on-screen in 2024 7 days ago Culture Why we're 'living in a golden age of the doppelganger' 4 Dec 2024 Culture The party song that became a US anthem in 2024 13 Dec 2024 Culture Editor's picks from 2024 Churchill's 'secret weapon' against the Nazis Churchill's daughter-in-law and confidante Pamela Harriman has been described as \"the greatest courtesan of her era\". Was she a smart power player – or \"shameless\" and \"repellent\"? See more Life as 'the most beautiful woman in movie history' 17 Apr 2024 Culture Why medieval people slept in cupboards 22 Jan 2024 Future The country where residents live longer than ever 10 Oct 2024 Travel Discover more from the BBC Subscribe to Future Earth Essential climate news and hopeful developments across the globe, every Tuesday in your inbox. Download the BBC app Click here to download the BBC app for Apple and Android devices. US Election Unspun Cut through the spin with North America correspondent Anthony Zurcher - in your inbox every Wednesday and Friday. Listen to The Global Story Global perspectives on one big story. In-depth insights from the BBC, the world's most trusted international news provider. Register for a BBC account Don't have time to read everything right now? Your BBC account lets you save articles and videos for later. The Essential List The week’s best stories, handpicked by BBC editors, in your inbox every Friday. Sign up to News Briefing News and expert analysis for every schedule. Get the morning and evening editions of our flagship newsletter in your inbox. Popular features of 2024 1 The deep ocean photographer that captured a 'living fossil' 2 Four holiday spots where tourists are welcome 3 Seven of the Paris Olympics' most striking images – as classical artworks 4 'He was a monster': How history got Henry VIII wrong 5 What happened when India banned TikTok US & Canada news Four revelations from the House ethics report on Matt Gaetz 1 hr ago US & Canada The US town where it's the law to own a gun 7 hrs ago US & Canada Former US President Bill Clinton admitted to hospital with fever 8 hrs ago US & Canada Biden commutes most federal death sentences The president condemns the murderers but says the death penalty at federal level \"must stop\". 8 hrs ago US & Canada Israel-Gaza war Israel confirms it killed Hamas leader Haniyeh in Tehran 10 hrs ago Middle East Children among dozens killed in Israeli strikes, Gaza officials say 18 hrs ago Middle East US warplane shot down in Red Sea 'friendly fire' incident 2 days ago Middle East Gaza ceasefire talks 90% complete, Palestinian official tells BBC The senior official said a ceasefire deal is close but key issues remain that need to be bridged. 2 days ago Middle East War in Ukraine 'More Ukrainians than ever seeking host families' 2 hrs ago Surrey 'Hard to feel festive' says Ukrainian refugee 2 hrs ago Manchester The famous Christmas carol inspiring Ukraine's defenders 2 hrs ago Europe What we know about North Korean troops fighting Russia's war Some observers say we should not be too quick to dismiss Pyongyang's military capabilities. 4 hrs ago World More world news Detained Ugandan politician's wife condemns ban on Christmas Day visit 8 hrs ago Africa Clarity needed over Holyhead reopening, say hauliers 11 hrs ago Europe Mauritius hints Chagos talks stuck over money 16 hrs ago Africa PM and Zelensky discuss UK training of Ukrainian forces In a call, the leaders agree to refine the UK's training programme to \"bolster\" Ukraine's defence. 17 hrs ago Europe Video How 'cancelling' Christmas reignited a civil war What happened when the British parliament of the 1640s made celebrating Christmas illegal? See more Sport LIVE Premier League news conferences, team news and build-up 'Self-doubt, errors & big changes' - inside the crisis at Man City 2 hrs ago Man City Amorim questions 'choices' of Rashford's advisors 13 hrs ago Man Utd Cross loses as record number of seeds out of Worlds Former champion Rob Cross is knocked out of the 2025 World Darts Championships as a record number of seeds fall in the second round at Alexandra Palace. 8 hrs ago Darts Business Brazil shuts BYD factory site over 'slavery' conditions 50 mins ago World Cadbury loses royal warrant after 170 years 20 hrs ago Birmingham & Black Country Honda and Nissan join forces to take on China in cars 17 hrs ago Consultation launched in UK over petrol car phase-out The government says it will \"restore clarity\" for vehicle manufacturers and the charging industry. 19 mins ago Business Tech Why AI chatbots are 'tasting' colours 22 hrs ago Future Morrisons apologises after discount and delivery issues 12 hrs ago Technology Google suggests fixes to its search monopoly 3 days ago Technology The rise of Spotify Wrapped and its copycats From Duolingo to Sainsbury's, companies have hopped onto the year in review bandwagon following the success of Spotify Wrapped. 3 days ago Technology Science & health Researchers study impact of singing on wellbeing 1 day ago Bristol 'Lungs in a box' could increase vital transplants 1 day ago England Doctors warn over water bead gifts for children 1 day ago UK 'I wouldn't poo if my husband was at home' Embarrassment around bowel habits is preventing people discussing symptoms - so what is a normal poo? 2 days ago Wales Culture How It's a Wonderful Life became a Christmas classic 21 hrs ago Culture Blake Lively and Justin Baldoni: What you need to know 15 hrs ago Culture Hollywood stars support Blake Lively over legal complaint 22 hrs ago Culture The TV highlights to look out for over Christmas You've heard about Wallace & Gromit and Gavin & Stacey, but there are plenty of other festive treats. 18 hrs ago Culture Arts How a 1990s Swan Lake changed dance forever 27 Nov 2024 Culture Colourful life of 100-year-old artist who's never used a paint brush 15 Dec 2024 Wales Artists imagine a new utopia for Kenya's capital 30 Nov 2024 Africa The hidden meanings in a 16th-Century nude sketch How a rarely-seen drawing of the Three Graces by Raphael reveals the era's ideas about nudity, modesty, shame – and the artist's genius. 20 Nov 2024 Culture Travel A nostalgic French drink that evokes Christmas 2 days ago Travel Seven of New England's best ski experiences 3 days ago Travel Sweden's real-life candy cane village 4 days ago Travel The towns that inspired 100 Years of Solitude As a new Netflix series thrusts Gabriel García Márquez's masterpiece back into the spotlight, these are the real-life places that inspired the writer's magical realism. 5 days ago Travel Earth Cook shares tips to limit food waste this Christmas 2 days ago Bristol Cyclone Chido kills 94 people in Mozambique 2 days ago Africa How I transformed a Christmas jumper in five weeks 2 days ago Future Experience David Attenborough's first expedition in colour First broadcast in 1954, the celebrated naturalist's first on-screen appearance is now available in colour. 3 days ago Natural wonders British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Video Live Audio Weather BBC Shop BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info Contact technical support Copyright 2024 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image_count": 36,
  "text_length": 12777
}