{
  "url": "https://www.bbc.com/",
  "size": 422244,
  "time": 0.6514065265655518,
  "status": "成功",
  "performance": {
    "dns_time": 0.0,
    "connect_time": 0,
    "response_time": 0.49829649925231934,
    "download_time": 0.0,
    "parse_time": 0.15311002731323242,
    "total_time": 0.664088249206543,
    "image_count": 36,
    "text_length": 12799,
    "html_size": 422244,
    "status_code": 200
  },
  "domain": "www.bbc.com",
  "content_type": "text/html; charset=utf-8",
  "status_code": 200,
  "headers": {
    "Connection": "keep-alive",
    "Content-Length": "70722",
    "Content-Type": "text/html; charset=utf-8",
    "belfrage-cache-status": "MISS",
    "bid": "sally",
    "brequestid": "f07d738cbbf34cb4af709a0c2fa2c764",
    "bsig": "1651d2367f46daf5fe7958c1ba501eac",
    "cache-control": "public, stale-if-error=90, stale-while-revalidate=30, max-age=30",
    "content-encoding": "gzip",
    "referrer-policy": "no-referrer-when-downgrade",
    "req-svc-chain": "FASTLY,GTM,BELFRAGE,BBCX",
    "via": "1.1 BBC-GTM, 1.1 Belfrage, 1.1 varnish",
    "x-content-type-options": "nosniff",
    "x-correlation-id": "ef6d3e57-46ec-42c9-bc44-08a1761eb028",
    "x-envoy-upstream-service-time": "429",
    "x-frame-options": "SAMEORIGIN",
    "Origin-Agent-Cluster": "?0",
    "nel": "{\"report_to\":\"default\",\"max_age\":2592000,\"include_subdomains\":true,\"failure_fraction\":0.25}",
    "X-BBC-Edge-Cache-Status": "EXPIRED",
    "X-BBC-Origin-Response-Status": "200",
    "report-to": "{\"group\":\"default\",\"max_age\":2592000,\"endpoints\":[{\"url\":\"https://default.bbc-reporting-api.app/report-endpoint\",\"priority\":1}],\"include_subdomains\":true}",
    "Server": "BBC-GTM",
    "Strict-Transport-Security": "max-age=31536000; preload",
    "Fastly-Restarts": "1",
    "Accept-Ranges": "bytes",
    "Date": "Wed, 25 Dec 2024 13:35:24 GMT",
    "X-Fastly-Cache-Status": "HIT-CLUSTER",
    "X-Served-By": "cache-sin-wsss1830058-SIN",
    "X-Cache": "HIT",
    "X-Cache-Hits": "1",
    "X-Timer": "S1735133724.027336,VS0,VE11",
    "X-Fastly-Pre-Flight-Cache": "MISS, MISS",
    "X-Fastly-Pre-Flight-Cache-Status": "MISS-CLUSTER",
    "X-cache-age": "15",
    "X-LB-NoCache": "true",
    "Vary": "X-BBC-Edge-Scheme,Accept-Encoding",
    "alt-svc": "h3=\":443\";ma=86400,h3-29=\":443\";ma=86400,h3-27=\":443\";ma=86400"
  },
  "images": [
    "https://www.bbc.com/bbcx/grey-placeholder.png",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/fcf8/live/80c8fd90-c251-11ef-8c65-07a414099579.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/cb98/live/b1234f30-c29d-11ef-959c-41ad31a78463.jpg.webp",
    "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/56a8/live/5078d850-c2b9-11ef-a0f2-fd81ae5962f4.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0h0gy9w.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0k7chx0.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kcrl7d.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0923b5y.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p06tvfzt.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0gwy8z2.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0h0mkk8.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0fk7t1y.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0dl802j.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0jsc9yw.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kd3mtz.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0hqgn5b.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0hh6r6r.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0k21mvc.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0jq6tfl.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/640x360/p0gstygv.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/raw/p0k21mq7.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0h74xp9.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/1920x1080/p0h74xqs.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/2311/live/4d1ac730-c21f-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/5629/live/de102620-c07d-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/8079/live/d92ab240-c052-11ef-8b55-6daa1fbb4532.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/319e/live/29502d30-c22a-11ef-aff0-072ce821b6ab.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p091py24.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/5903/live/f461ae70-c1d2-11ef-9e92-076070f32991.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/583b/live/a893c9f0-c110-11ef-b791-a17ee38c7e8f.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/924d/live/3d97e170-bfbe-11ef-b603-e7778b27f3fc.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/221b/live/d0d4a030-b588-11ef-b897-0bca9b42570f.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/442a/live/05023130-c21b-11ef-a2ca-e99d0c9a24e3.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0k5m02k.jpg.webp",
    "https://ichef.bbci.co.uk/images/ic/480x270/p0kd221n.jpg.webp",
    "https://ichef.bbci.co.uk/news/480/cpsprodpb/6483/live/2da73920-bbc5-11ef-a187-01dd04081743.jpg.webp"
  ],
  "text": "BBC Home - Breaking News, World News, US News, Sports, Business, Innovation, Climate, Culture, Travel, Video & Audio Skip to content British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Video Live Audio Weather Newsletters Greenland and the Panama Canal aren't for sale. Why is Trump threatening to take them? Trump's promises to use America's strength to its advantage helped propel him twice to the White House. 13 hrs ago World Dozens killed as passenger plane crashes in Kazakhstan About 30 of those board survived the accident near the western Kazakh city of Aktau. 2 hrs ago Europe Greenland and the Panama Canal aren't for sale. Why is Trump threatening to take them? Trump's promises to use America's strength to its advantage helped propel him twice to the White House. 13 hrs ago World Dozens killed as passenger plane crashes in Kazakhstan About 30 of those board survived the accident near the western Kazakh city of Aktau. 2 hrs ago Europe LIVE Russia says Christmas Day attack on Ukraine was a success, as Zelensky calls strikes 'inhumane' Ukraine's air force says it detected 184 missiles and drones, causing damage to energy infrastructure across the country. Palestinian Christians struggle to find hope at Christmas For the second year running, tourists are staying away and public festivities have been cancelled. 8 hrs ago Middle East NY subway death accused fanned flames with shirt, prosecutors say The woman fatally set alight on a Brooklyn train was attacked by a man she is not believed to have known. 15 hrs ago US & Canada Santa Cruz Wharf partially collapses due to pacific storm California's central coast was hit by heavy surf from a major storm that was expected to bring hurricane-force winds. 22 hrs ago US & Canada Israel investigation says army actions had 'influence' on killing of six hostages by Hamas It also said that soldiers did not know the hostages were there when they began their operation. 3 hrs ago Middle East Festive favourites The Christmas Truce that paused WW1 In 1914, in a poignant moment of shared humanity, British and German troops entered into a spontaneous ceasefire over the Christmas period. 25 Dec 2023 Culture Why we feel the need to feast together For thousands of years, humans have come together in groups to feast on food. Why is it important – and why do we still continue the tradition? 27 Nov 2024 Future More news Modernism and Islamic motifs: How Indian artists envisioned Christ's birth 15 hrs ago Asia Ukraine's war stamps put humour, patriotism and swearing in the post 13 hrs ago Europe Watch: ISS crew sends Christmas greetings from space 4 hrs ago Science & Environment Crowds gather as UK royals attend Christmas Day church service 6 mins ago UK Owner and architect of Turkey quake collapse hotel jailed 2 hrs ago Europe Festive picks The little-known truth behind a Christmas tale Science says that Santa must have a crew of female reindeer. So why do we think Rudolph the reindeer is a boy? 7 days ago Culture & Experiences The psychology behind why we give gifts Gift-giving is more than a tradition – it’s a part of our evolutionary history. 23 Feb 2022 Psychology Europe's real nightmare before Christmas He’s a part goat, part devil who punishes naughty children. 23 Feb 2022 Humans The surprising origins of five iconic toys Mr Potato Head, slinky, water balloon, Super Soaker, Monopoly. You know them. But do you know their origin story? 12 Dec 2023 History Behind the scenes of Paul Giamatti's new Christmas classic Paul Giamatti gives us an inside look at his new film: The Holdovers. 20 Dec 2023 Film & TV How to make the perfect Victoria Sponge cake Claire Ptak uses brown sugar instead of white in her Victoria Sponge as it yields a moister cake. 8 Nov 2023 World's Table The astonishing pagan origin of Christmas The Angle-Saxon pagan tradition that became Christmas. 19 May 2023 Culture South African Braai: What it is and why you should try it The Braai tradition in South Africa is more than just a BBQ, it's a phenomenon that ties the nation together. 24 Sep 2024 World's Table Year in review 12 of the most striking images of 2024 From the awe-inspiring photo of a surfer in Tahiti to the iconic shot of US President-elect Trump after an assassination attempt, these are our picks for the most eye-catching images of the year. See more The 10 films getting the biggest early Oscar buzz 8 Nov 2024 Culture Why Katy Perry's comeback has gone so wrong 20 Sep 2024 Culture Roman historians on Gladiator II's inaccuracies 22 Nov 2024 Culture Editor's picks from 2024 This is how you make the world's oldest beer An ancient recipe for Mesopotamian beer has survived the millennia to find new life as a modern drink. See more Eight photos that make us question what we see 12 Jul 2024 Culture The deep ocean photographer that captured a 'living fossil' 8 May 2024 Future My journey to reclaim Jamaica's mother tongue 29 Sep 2024 Future Discover more from the BBC In History Discover the headlines from this week in history. See the past come to life through the BBC's unique archive, in your inbox every Thursday. Download the BBC app Click here to download the BBC app for Apple and Android devices. World of Business Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday. Listen to The Global Story Global perspectives on one big story. In-depth insights from the BBC, the world's most trusted international news provider. Register for a BBC account Don't have time to read everything right now? Your BBC account lets you save articles and videos for later. The Essential List The week’s best stories, handpicked by BBC editors, in your inbox every Friday. Sign up to News Briefing News and expert analysis for every schedule. Get the morning and evening editions of our flagship newsletter in your inbox. Popular features of 2024 1 The deep ocean photographer that captured a 'living fossil' 2 Four holiday spots where tourists are welcome 3 Seven of the Paris Olympics' most striking images – as classical artworks 4 'He was a monster': How history got Henry VIII wrong 5 What happened when India banned TikTok US & Canada news Where is Santa right now? These people know 16 hrs ago US & Canada Ex-Abercrombie & Fitch CEO has dementia, lawyers say 19 hrs ago US & Canada Former US President Bill Clinton discharged from hospital after flu 20 hrs ago US & Canada Weather and airport delays disrupt American Christmas travel While Americans on the east coast brace for snow, on the west coast some are facing flooding and high surf warnings. 20 hrs ago US & Canada Israel-Gaza war Israel investigation says army actions had 'influence' on killing of six hostages by Hamas 3 hrs ago Middle East Palestinian Christians struggle to find hope at Christmas 8 hrs ago Middle East Israel confirms it killed Hamas leader Haniyeh in Tehran 2 days ago Middle East Children among dozens killed in Israeli strikes, Gaza officials say A school sheltering displaced families was hit, according to Gaza's civil defence agency. 2 days ago Middle East War in Ukraine Zelensky condemns 'inhumane' Christmas Day attack 13 mins ago Europe Ukraine's war stamps put humour, patriotism and swearing in the post 13 hrs ago Europe Ukrainian refugee's third Christmas away from home 1 day ago Berkshire 'More Ukrainians than ever seeking host families' Charity GUkraine says it has helped about 2,500 people since early 2022 when the war broke out. 1 day ago Surrey More world news Three shot dead as medics, journalists and police attacked at Haiti hospital 7 hrs ago Latin America Toxic spill fears follow deadly Brazil bridge collapse 16 hrs ago Latin America Protests in Syria over Christmas tree burning 18 hrs ago Middle East Pope opens Holy Door to kick off special jubilee year More than 30 million Catholic pilgrims are expected to head to Rome for the jubilee, which takes place once every 25 years. 18 hrs ago Europe Video How 'cancelling' Christmas reignited a civil war What happened when the British parliament of the 1640s made celebrating Christmas illegal? See more Sport 'Self-doubt, errors & big changes' - inside the crisis at Man City 1 day ago Man City ICC announce Champions Trophy 2025 fixtures 23 hrs ago Cricket Amorim questions 'choices' of Rashford's advisors 2 days ago Man Utd Konstas, 19, to make Australia debut in Boxing Day Test Opener Sam Konstas is set to become Australia men's youngest Test batting debutant in 71 years in the Boxing Day Test against India. 1 day ago Australia Business Ex-Abercrombie & Fitch CEO has dementia, lawyers say 19 hrs ago US & Canada American Airlines resumes flights after technical issue 22 hrs ago US & Canada Brazil shuts BYD factory site over 'slavery' conditions 1 day ago World Cadbury loses royal warrant after 170 years The British chocolate maker says it is disappointed to be stripped of the endorsement. 2 days ago Birmingham & Black Country Tech Why AI chatbots are 'tasting' colours 2 days ago Future Morrisons apologises after discount and delivery issues 2 days ago Technology Google suggests fixes to its search monopoly 4 days ago Technology The rise of Spotify Wrapped and its copycats From Duolingo to Sainsbury's, companies have hopped onto the year in review bandwagon following the success of Spotify Wrapped. 4 days ago Technology Science & health Spacecraft attempts closest-ever approach to Sun 1 day ago Science & Environment Hospitals trial AI to spot type 2 diabetes risk 1 day ago Health 'I run to inspire others with mental health issues' 1 day ago Bristol Researchers study impact of singing on wellbeing About 300 people took part in the Sing For Happiness research project in the run-up to Christmas. 2 days ago Bristol Culture The powerful music biopic - with a CGI chimp hero 3 hrs ago Culture Liam Payne's girlfriend says Christmas a 'time of grief and sadness' 4 hrs ago UK 'Fatherhood's like the early days of Franz Ferdinand' 14 hrs ago Glasgow & West Scotland Blake Lively's claims put spotlight on 'hostile' Hollywood tactics The actress' explosive legal case claims to lift the lid on tactics used to destroy stars' reputations. 18 hrs ago Culture Arts How a 1990s Swan Lake changed dance forever 27 Nov 2024 Culture Colourful life of 100-year-old artist who's never used a paint brush 15 Dec 2024 Wales Artists imagine a new utopia for Kenya's capital 30 Nov 2024 Africa The hidden meanings in a 16th-Century nude sketch How a rarely-seen drawing of the Three Graces by Raphael reveals the era's ideas about nudity, modesty, shame – and the artist's genius. 20 Nov 2024 Culture Travel BBC Travel's favourite stories of 2024 35 mins ago Travel The country where residents live longer than ever 1 day ago Travel A nostalgic French drink that evokes Christmas 3 days ago Travel Seven of New England's best ski experiences Chris Davenport is a born New Englander who learned his craft on the region's best slopes. Here are his favourite places to ski in the north-east, from Jay Peak to Stowe. 4 days ago Travel Earth The animals that give each other gifts 1 day ago Future Scientists unveil 50,000-year-old baby mammoth remains 2 days ago Europe How can you have an eco-friendly Christmas? 2 days ago Wales Cook shares tips to limit food waste this Christmas Thousands of followers watch the chef's RolloverLeftovers series on Instagram. 3 days ago Bristol British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Video Live Audio Weather BBC Shop BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info Contact technical support Copyright 2024 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image_count": 36,
  "text_length": 12799
}